

/**
 * 车牌省份
 */
export const CAR_PROVINCES = ['京', '津', '冀', '晋', '蒙', '辽', '吉', '黑', '沪', '苏', '浙', '皖', '闽', '赣', '鲁', '豫', '鄂', '湘', '粤', '桂', '琼', '渝', '川', '贵', '云', '藏', '陕', '甘', '青', '宁', '新', '临'];

/**
 * 默认车牌省份
 */
export const DEFAULT_PROVINCE = '粤';

/**
 * 车牌号码
 */
export const CAR_CHAR = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0', 'Q', 'W', 'E', 'R', 'T', 'Y', 'U', 'O', 'P', 'A', 'S', 'D', 'F', 'G', 'H', 'J', 'K', 'L', 'Z', 'X', 'C', 'V', 'B', 'N', 'M', '港', '澳', '学', '领'];
/**
 * 车牌号码第一位
 */
export const CAR_1_INCLUDE = ['1', '2', '3', '4', '5', '6', '7', '8', '9', '0'];
/**
 * 车牌号码第二位包含O
 */
export const CAR_2_INCLUDE = ['O'];
/**
 * 车牌号码第七位包含字符
 */
export const CAR_7_INCLUDE = ['港', '澳', '学', '领'];

/**
 * 车牌正则表达式
 */
export const CAR_REGEXP = /^[京津沪渝冀豫云辽黑湘皖鲁新苏浙赣鄂桂甘晋蒙陕吉闽贵粤青藏川宁琼使领][A-HJ-NP-Z][A-HJ-NP-Z0-9]{4,5}[A-HJ-NP-Z0-9挂学警港澳]$/;
